scores = [70, 81, 65, 67, 65, 95, 97, 78, 82, 63, 73, 56, 77, 68, 74, 98, 84, 17, 45, 82, 91, 57, 77, 62, 65, 51, 83, 67, 69, 49, 55, 43, 83, 70, 90, 100, 55, 37, 40, 97, 71, 74, 74, 100, 95, 96, 60, 93, 87, 59, 72, 100, 86, 65, 57, 75, 46, 98, 75, 48, 75, 77, 68, 75, 54, 59, 58, 64, 61, 49, 27, 74, 82, 65, 78, 82, 93, 62, 71, 65, 94, 52, 61, 100, 100, 86, 62, 75, 100, 67, 100, 43, 46, 33, 87, 38, 56, 44, 79, 77]

start = int(input())
end = int(input())
selected_scores = scores[start:end+1]
average_score = sum(selected_scores) / len(selected_scores)
print(f"{average_score:.2f}")
# 리스트가 선언되어 있고 시작과 끝을 정해준다면 이를 잘라준다. 끝 인덱스에 1을 더해주어야 정확하게 잘릴 수 있고
# "{:.2f}".format(average_score)는 무슨 의미일까?